{
    "ProjectData":[
    {
    "name": "Excavated Evil",
    "overview": "A co-operative board game that utilizes digital technology to enhance the player experience.",
    "thumbnail": "/excavatedevil.png",
    "urlName":"excavatedevil",
    "images":["/excavatedevil.png","/excavatedevil.png"],
    "type":"games",
    "description":"<p>Though board games have always been a traditional analog game format, there is no reason they can’t take advantage of the innovation that has occurred in the fields of video game design and digital computation. My project, Martyr, is one of the first explicitly hybrid digital board games. I created this project with the goal of identifying which characteristics of video games are most suitable to adapt into a board game environment</p><p>The premise of the game itself is that ghouls have been causing mysterious disappearances in Haven City. The players must explore the city to find holy items and hints as to where the ghouls are hiding. After the players believe they have pinpointed the correct location, they must bring the holy items there and purify the area to win the game.</p><p>One common trend in video games that Martyr leverages is procedural generation. Each time the game is played, the content of a given board location is different. Traditional board games replicate this effect through mechanics like shuffling and drawing from various card decks. The advantage of handling randomness with a computer is that it reduces the burden of the players. Rather than gathering cards together, shuffling them, and placing the decks in designated locations as setup, the players can focus on playing the game.</p>",

    "platform": "Print",
    "tools": "Arduino, Adobe Illustrator, Photoshop",
    "language": "Python",
    "team": "1",
    "role": "Designer, Programmer",
    "featured": true
    },
    {
    "name": "Unowned Collected",
    "overview": "A generated board game, created from the rules of several existing games.",
    "thumbnail": "/UnownedCollected.png",
    "urlName":"unowned",
    "images":["/UnownedCollected.png","/UnownedCollected.png"],
    "type":"games",
    "description":"<p>My original idea was to make a board game by using the rule sets of existing games to generate my own rules, and I've pretty much stuck with the same idea throughout the process. I wanted to do this project for two main reasons. The first is that although this class is pretty much all about writing code, I wanted to have an output that had a physical form. The second reason is that I'm really passionate about games, and although I do really love video games, I also know that board games are in a bit of a 'renaissance' right now and I wanted to be a part of it. As a bit of background on that, board games are one of the most successful categories for Kickstarter, and in the U.S. at least there has been a renewed interest in board game cafes and tabletop stores.</p><p>Some of my inspiration also came from the games themselves. Although they are not generated games, many have generative aspects. Games like Carcassone, for example, do not come with a game board, but allow the players to build the playing field as the game progresses (most references to 'land tiles' in my game originated from Carcassone's rules). Another inspiration was a game I encountered in my Intro to Game Dev class called Life in the Garden, which is perhaps more story than game. The contents consists of a deck of cards, each with a couple of sentences on them. You shuffle them, draw a few, read them out, and a complete story can be made from any order. (http://www.electronicbookreview.com/thread/firstperson/edenic)</p>",

    "platform": "Print",
    "tools": "Adobe Illustrator, NLTK",
    "language": "Python",
    "team": "1",
    "role": "Programmer"
  },

  {
    "name": "Princess Liberation",
    "overview": "A two player platformer game that subverts the dynamic between Knight and Princess.",
    "thumbnail": "/princess.png",
    "urlName":"liberation",
    "images":["/princess.png"],
    "type":"games",
    "description":"<p>Princess Liberation is a local multiplayer platformer game inspired by <a href ='https://onmogul.com/stories/this-time-the-dragon-saves-the-princess'>this</a> webcomic, in which a knight attempts to 'rescue' a princess from the evil dragon. In a subversion of the usual trope, it turns out that the princess and dragon are actually friends, and the dragon is protecting her from unsuitable suitors.</p><p>I worked together with a team of three other students to translate the web comic into a 2D platformer game. One player controls the knight, who has the ability to move, jump to platforms, and destroy obstacles with his sword. The dragon riding princess has the ability to shoot slowing bolts, breathe fireballs that knock the knight down a platform, and place obstacles.</p><p>One of the more experimental designs we implemented was making the knight's controls exclusive to the keyboard and the princess' exclusive to the mouse. Though the knight's controls are very traditional, using wasd and spacebar to jump, the Princess moves across the screen by using the scrollwheel, and all the rest of her abilities can be performed using right and left clicks.</p><p>My primary role was</p>",

    "platform": "Windows PC",
    "tools": "Unity3D",
    "language": "C#",
    "team": "4",
    "role": "Lead Programmer, Co-designer",
    "featured": true
  },
  {
    "name": "GATE",
    "overview": "A 2D puzzle platformer initially created for the game jam theme 'color'",
    "thumbnail": "/gate.png",
    "urlName":"gate",
    "images":["/gate.png","/gate.png"],
    "type":"games",
    "description":"<p>This game was a project for my university's first 24 hour game jam, following the theme 'color'. My primary design goal was to create a fluid and dynamic feeling movement. The player's sole form of movement is by way of grappling hook. However, the player can only grapple to nodes that match the player's current color. Passing through a gate will change the player's color. If the player's color does not match the node when they arrive, they will fall down, instead of locking on to it.\n I am currently working to develop this prototype into a full game by designing more levels, creating more polished art and animations, and adapting the controls for mobile devices.</p>",

    "platform": "In Development",
    "tools": "Unity3D",
    "language": "C#",
    "team": "1",
    "role": "Designer, Programmer"
  },

  {
    "name": "Keepers of Ra",
    "overview": "A transmedia storytelling project born out of a tabletop RPG campaign.",
    "thumbnail": "/Ra2.png",
    "urlName":"ra",
    "images":["/Ra2.png","/Ra2.png"],
    "type":"media",
    "description":"<p>A crossover between a New World of Darkness campaign and the real world.</p>",
    "featured": true
  },
  {
    "name": "Forest Fire",
    "overview": "A modular origami project elegizing California.",
    "thumbnail": "/forestfire3.jpg",
    "urlName":"forestfire",
    "images":["/forestfire1.jpg","/forestfire2.jpg","/forestfire3.jpg"],
    "type":"media",
    "description":"<p>Created by a Californian artist living in Asia, this project explores the beauty and destruction of wildfires through origami. Viewed from above, these origami trees resemble a colorful arrangement of flowers. From the side, however, their true form becomes cleaer.</p>"
  },
  {
    "name": "Melding into Nothing",
    "overview": "A series of programmatic photo-manipulations of the NYC skyline.",
    "thumbnail": "/skyline.png",
    "urlName":"nyc",
    "images":["/skyline.png","/skyline.png"],
    "type":"media",
    "description":"<p>A E S T H E T I C</p><p>Pixelated vaporwave nonsense.</p>"
  }
    ]
}


